croghostrider/esp32_hd/main/hd_main.c
/*
esp32_hd
Copyright (c) 2018 ys1797 (yuri@rus.net)

License (MIT license):
  Permission is hereby granted, free of charge, to any person obtaining a copy
  of this software and associated documentation files (the "Software"), to deal
  in the Software without restriction, including without limitation the rights
  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  copies of the Software, and to permit persons to whom the Software is
  furnished to do so, subject to the following conditions:
  The above copyright notice and this permission notice shall be included in
  all copies or substantial portions of the Software.
  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
  THE SOFTWARE.
*/

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"
#include "freertos/portmacro.h"
#include "freertos/xtensa_api.h"
#include "freertos/event_groups.h"
#include "freertos/timers.h"
#include "esp32/rom/rtc.h"
#include "esp_system.h"
#include "esp_idf_version.h"
#include "esp_event.h"
#include "esp_spiffs.h"
#include "esp_vfs_fat.h"
#include "esp_log.h"
#include "esp_console.h"
#include "esp_vfs_dev.h"
#include "nvs_flash.h"
#include "driver/gpio.h"
#include "driver/timer.h"
#include "driver/uart.h"
#include "linenoise/linenoise.h"
#include "argtable3/argtable3.h"
#include "driver/ledc.h"
#include "driver/sdspi_host.h"
#include "sdmmc_cmd.h"
#include "soc/ledc_struct.h"
#include "math.h"
#include "time.h"
#include <sys/time.h>
#include <sys/types.h>
#include <unistd.h>
#include <dirent.h>
#include <cJSON.h>
#include "lwip/apps/sntp.h"
#include "ds.h"
#include "hd_bmp180.h"
#include "esp_platform.h"
#include "config.h"
#include "hd_spi_i2c.h"
#include "hd_wifi.h"
#include "hd_main.h"
#include "cgiupdate.h"
#include "cgiwebsocket.h"
#include "esp_request.h"
#include "debug.h"


//#define GPIO_INPUT_PIN_SEL  (1<<GPIO_DETECT_ZERO) 
#define GPIO_OUTPUT_BEEPER  (1<<GPIO_BEEP)

volatile int32_t Hpoint = HMAX;
volatile int zero_imp_shift;


#define TIMER_DIVIDER   80		/*!< Hardware timer clock divider */
#define TIMER_SCALE (TIMER_BASE_CLK / TIMER_DIVIDER) /*!< used to calculate counter value */
#define TIMER_FINE_ADJ   (0*(TIMER_BASE_CLK / TIMER_DIVIDER)/1000000) /*!< used to compensate alarm value */ 
#define TIMER_INTERVAL_SEC   (0.001)   /*!< test interval for timer */ 

char *Hostname;		// Имя хоста
char *httpUser;		// Имя пользователя для http
char *httpPassword;	// Пароль для http
int httpSecure;		// Спрашивать пароль
int wsPeriod=5;		// Период обновления данных через websocket

unsigned char ds1820_devices;                  // Количество датчиков ds18b20

// клапана
unsigned char klp_gpio[4] =  {26, 27, 32, 33};
klp_list Klp[MAX_KLP];		// Список клапанов.
xQueueHandle valve_cmd_queue; // очередь команд клапанов
void valveCMDtask(void *arg);
void cmd2valve (int valve_num, valve_cmd_t cmd);
void restoreProcess(void);

/* Время */
volatile uint32_t tic_counter;
volatile uint32_t uptime_counter;
volatile int gpio_counter = 0;
volatile uint32_t setDelay = 5;

/* Данные режима работы */
main_mode MainMode = MODE_IDLE;	// Текущий режим работы
int16_t MainStatus=START_WAIT;		// Текущее состояние (в зависимости от режима)
bool broken_proc = false;					// признак старта после прерванного процесса

alarm_mode AlarmMode = NO_ALARM;	// Состояние аварии
int16_t CurPower;			// Текущая измерянная мощность
int16_t SetPower;			// Установленная мощность
int16_t CurVolts;			// Текущее измеренное напряжение
volatile int16_t CurFreq;		// Измерянное число периодов в секунду питающего напряжения
int16_t WaterOn =-1;			// Флаг включения контура охлаждения
float TempWaterIn = -1;			// Температура воды на входе в контур
float TempWaterOut = -1; 		// Температура воды на выходе из контура
int16_t WaterFlow=-1;			// Значения датчика потока воды.
int16_t fAlarmSoundOff=0;

// Динамические параметры
double tempTube20Prev;		// Запомненое значение температуры в колонне
uint32_t secTempPrev;		// Отметка времени измеренной температуры
double  tempStabSR;		// Температура, относительно которой стабилизируется отбор СР
int16_t ProcChimSR = 0;		// Текущий процент отбора СР
double  startPressure = -1;	// Атмосферное давление в начале процесса
#define COUNT_PWM	15	// Размер таблицы автоподбора шим

typedef struct {
	double temp;
	int16_t pwm;
} autopwm;
autopwm autoPWM[COUNT_PWM] = {
	{0, -1},
	{88.0, 68},
	{96.0, 25},
	{100, 0},
	{0,0},
	{0,0},
	{0,0},
	{0,0},
	{0,0},
	{0,0},
	{0,0},
	{0,0},
	{0,0},
	{0,0},
	{0,0}
};

#ifdef DEBUG
TickType_t xOpenTime=0,xCloseTime=0;
#endif


int16_t rect_timer1=0;		// Таймер для отсчета секунд 1
int16_t timer_sec2=0;		// Таймер для отсчета секунд 2
int16_t timer_sec3=0;		// Таймер для отсчета секунд 3
int32_t SecondsEnd;		// Время окончания процесса
RESET_REASON resetReason;	// Причина перезагрузки
nvs_handle nvsHandle;

static volatile int beeperTime=0;
static volatile bool beepActive = false;

// Включаем бипер
void IRAM_ATTR myBeep(bool lng)
{
	if (beepActive) return;

	if (lng) beeperTime = 1000;	
	else beeperTime = 500;
	beepActive = true;
	GPIO_ON(GPIO_BEEP);
}

void shortBeep(void)
{
	if (beepActive) return;
	beeperTime = 150;
	beepActive = true;
	GPIO_ON(GPIO_BEEP);
}

double roundX (double x, int precision)
{
   int mul = 10;
   
   for (int i = 0; i < precision; i++)
      mul *= mul;
   if (x > 0)
      return floor(x * mul + .5) / mul;
   else
      return ceil(x * mul - .5) / mul;
}

extern uint8_t PZEM_Version;	// Device version 3.0 in use ?
bool is_diffOffCondition(void);

void set_proc_power(char* param_name){
	int16_t pw;
	if (broken_proc){
		nvs_get_i16(nvsHandle, "SetPower", &pw); //мощность процесса на момент прерывания
		broken_proc=false;
	}
	else {
		pw = getIntParam(DEFL_PARAMS, param_name);  //  мощность процесса из настроек
	}
	setPower(pw); //мощность до выключения
}

void diffOffTask(void *arg){
	openKlp(klp_diff);
	vTaskDelay(5000/portTICK_PERIOD_MS);
	closeKlp(klp_diff);
	vTaskDelete(NULL);
}

void alarmControlTask(void *arg){
	int vDIFFoffDelaySec;
	bool offByoverPwr,offByT;

	while(1) {
		if (AlarmMode){	//EXISTS_ALARM(ALARM_FREQ | ALARM_NOLOAD | ALARM_PZEM_ERR | ALARM_TEMP | ALARM_SENSOR_ERR)
			if (!fAlarmSoundOff)	myBeep(false);
		}
		offByoverPwr = getIntParam(DEFL_PARAMS, "alarmDIFFoffP") ;
		offByT= getIntParam(DEFL_PARAMS, "alarmDIFFoffT");
		vDIFFoffDelaySec = getIntParam(DEFL_PARAMS, "DIFFoffDelay");

		if ((EXISTS_ALARM(ALARM_OVER_POWER) && offByoverPwr) ||  (EXISTS_ALARM(ALARM_TEMP) &&  offByT))
		{
			//ERR_MSG("start DIFF-OFF proc. Delay (%d sec). Alarm:%d",vDIFFoffDelaySec,AlarmMode);
			for (int i=0;i<vDIFFoffDelaySec;i++){// задержка выключения диф-автомата
				if (!fAlarmSoundOff) shortBeep();
				vTaskDelay(SEC_TO_TICKS(1));
			}
			if (((EXISTS_ALARM(ALARM_OVER_POWER) && offByoverPwr) ||  (EXISTS_ALARM(ALARM_TEMP) &&  offByT)))
			{ // если ситуация не исправилась
				ERR_MSG("DIFF turned off");
				openKlp(klp_diff); 											// подаем напряжение (клапан 4)
				vTaskDelay(SEC_TO_TICKS(5));
				closeKlp(klp_diff);											// через 5 сек - снимаем напряжение с клапана
			}
		}
		vTaskDelay(1000/portTICK_PERIOD_MS);
	}
	vTaskDelete(NULL);
}

