croghostrider/esp32_hd/main/hd_main.c
// Установка рабочей мощности
void setPower(int16_t pw)
{
	int16_t mp;
	mp = getIntParam(DEFL_PARAMS, "maxPower");
	if (pw > mp) SetPower = mp;
	else SetPower = pw;

	if (pw > mp/2) {
		LEDC.channel_group[0].channel[0].duty.duty = (TRIAC_GATE_IMPULSE_CYCLES*3) << 4;
	} else {
		LEDC.channel_group[0].channel[0].duty.duty = TRIAC_GATE_IMPULSE_CYCLES << 4;
	}

	if (pw>0) setProcessGpio(1);
	else setProcessGpio(0);

	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "SetPower", SetPower);
	}
}                                                   

void setNewProcChimSR(int16_t newValue)
{
	LOG("PWM %d->%d",ProcChimSR,newValue);
	if (ProcChimSR != newValue) {
		ProcChimSR = newValue;
		if (nvsHandle) {
			nvs_set_i16(nvsHandle, "ProcChimSR", ProcChimSR);
		}
	}
}

void save_double_NVS(double newValue, const char* name){
	union {
		uint64_t i;
		double d;
	} var;
	var.d = newValue;
	if (nvsHandle) {
		ESP_ERROR_CHECK(nvs_set_u64(nvsHandle, name, var.i));
	}
}


void setTempStabSR(double newValue)
{
	if (tempStabSR != newValue){
		tempStabSR = newValue;
		save_double_NVS(newValue,"tempStabSR");
	}
}


static void setTempTube20Prev(double newValue)
{
	if (tempTube20Prev != newValue){
		tempTube20Prev = newValue;
		save_double_NVS(newValue,"tempTube20Prev");
	}
}

void set_status(int16_t newStatus)
{
	DBG("%d->%d",MainStatus,newStatus);
	if ((newStatus==PROC_END) &&
		((MainMode==MODE_DISTIL) || (MainMode==MODE_RECTIFICATION)) &&
		((MainStatus>PROC_RAZGON)&&(MainStatus<PROC_WAITEND))
		){
		MainStatus = PROC_WAITEND;
	}
	else {
		MainStatus = newStatus;
	}
	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "MainStatus", MainStatus);
	}
	if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
}


// Установка нового режима работы
void setMainMode(int nm)
{
	main_mode new_mode = (main_mode) nm;
	if (new_mode == MainMode) return; // Не изменился
	MainMode = new_mode;
	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "MainMode", nm);
	}

	if (SetPower) {
		setPower(0);
	}

	if (MainMode != MODE_POWEERREG) {
		set_status(START_WAIT);
	}

	switch (MainMode) {
	case MODE_IDLE:
		// Режим мониторинга
		LOG("Main mode: Idle.");
		break;
	case MODE_POWEERREG:
		// Режим регулятора мощности
		LOG("Main mode: Power reg.");
		if (MainStatus !=PROC_START)	setPower(getIntParam(DEFL_PARAMS, "ustPowerReg"));
		set_status(PROC_START);
		break;
	case MODE_DISTIL:
		// Режим дистилляции
		LOG("Main mode: Distillation.");
		break;
	case MODE_RECTIFICATION:
		// Режим ректификации
		LOG("Main mode: Rectification.");
		break;
	case MODE_TESTKLP:
		// Режим тестирования клапанов
		LOG("Main mode: Test klp.");
		break;
	}
	myBeep(false);
}

const state_vector_t rect_states[]={
	 {START_WAIT  /* START_WAIT	*/,PROC_START},
	 {START_WAIT  /* PROC_START	*/,PROC_RAZGON},
	 {START_WAIT  /* PROC_RAZGON	*/,PROC_STAB},
	 {PROC_RAZGON /* PROC_STAB	*/,PROC_GLV},
	 {PROC_STAB	/* PROC_GLV		*/,PROC_T_WAIT},
	 {PROC_GLV	/* PROC_T_WAIT	*/,PROC_SR},
	 {PROC_GLV	/* PROC_SR		*/,PROC_HV},
	 {PROC_SR		/* PROC_HV		*/,PROC_WAITEND},
	 {PROC_HV		/* PROC_WAITEND	*/,PROC_END},
	 {PROC_WAITEND	/* PROC_END		*/,START_WAIT}
};

const state_vector_t dist_states[]={
	 {START_WAIT  	/* START_WAIT*/,	PROC_START},
	 {START_WAIT  	/* PROC_START*/,	PROC_RAZGON},
	 {START_WAIT  	/* PROC_RAZGON*/,	PROC_DISTILL},
	 {PROC_RAZGON	/* PROC_STAB	*/,	PROC_DISTILL}, 			//inapplicable
	 {PROC_RAZGON	/* PROC_GLV		*/,	PROC_DISTILL},
	 {PROC_RAZGON	/* PROC_T_WAIT*/,	PROC_DISTILL},	//inapplicable
	 {PROC_RAZGON	/* PROC_DISTILL*/,	PROC_WAITEND},
	 {PROC_DISTILL	/* PROC_HV		*/,	PROC_WAITEND},
	 {PROC_DISTILL	/* PROC_WAITEND*/,PROC_END},
	 {PROC_WAITEND	/* PROC_END_	*/,	START_WAIT}
};


// Ручная установка состояния конечного автомата
void moveStatus(int next)
{
	if ((next) && (MainStatus>=PROC_END)) return;
	if ((!next) && (MainStatus<= START_WAIT)) return;

	int state=MainStatus;
	if (MainStatus==PROC_END) state=PROC_END_;

	const state_vector_t* vectors=NULL;

	switch (MainMode) {
		case MODE_DISTIL:
			vectors =  dist_states+state;
			break;
		case MODE_RECTIFICATION:
			vectors =  rect_states+state;
			break;
		default:
			vectors =  NULL;
	}

	if (vectors){
		if (next) { //шаг вперед
			state = vectors->nextState;
		}
		else { // на предыдущий
			state = vectors->prevState;
		}
	}
	else {
		if (next) { //шаг вперед
			state = PROC_END;
		}
		else { // на предыдущий
			state = START_WAIT;
		}
	}
	set_status(state);
}

/*
 * Если настройка "Количество значений в таблице обучения" больше 2
 * 		- вернет ШИМ по таблице-"шпоре" от температуры низа колонны
 * иначе
 * 		- вернет текущее ProcChimSR
 */
int16_t GetSrPWM(void)
{
	int16_t table_size=getIntParam(DEFL_PARAMS, "cntCHIM");
	if (table_size<2) return ProcChimSR;

	int16_t found = ProcChimSR;
	double t = getTube20Temp();

	DBG("first ProcChimSR:%d t:%0.2f table_size:%d",ProcChimSR,t,table_size);
	for (int i=1; i<table_size; i++) {
		if (autoPWM[i-1].temp <= t  && autoPWM[i].temp > t) {
			DBG("[%d]temp:%0.2f pwm:%d		[%d]temp:%0.2f pwm:%d",i-1,autoPWM[i-1].temp,autoPWM[i-1].pwm,i,autoPWM[i].temp,autoPWM[i].pwm);
			if (autoPWM[i-1].pwm > 0) {
				found = (t - autoPWM[i-1].temp) * 
					(autoPWM[i].pwm - autoPWM[i-1].pwm) / 
					(autoPWM[i].temp - autoPWM[i-1].temp) + autoPWM[i-1].pwm;
				DBG("pwm-1>0,  return %d",found);
				return found;
			}
		}	
	}
	DBG("after FOR, return %d",found);
	return found;
}

bool end_condition_SR(void){
	float tempEndRectOtbSR = getFloatParam(DEFL_PARAMS, "tempEndRectOtbSR");
	if (tempEndRectOtbSR>0)					// контроль по Т куба
		return (getCubeTemp() >= tempEndRectOtbSR);
	else							// контроль по Т20
		return (getTube20Temp() >= fabs(tempEndRectOtbSR) );
}

esp_err_t sensor_err(double t){
	if (t == -1.0) { // сбой датчика
		DBG("error'");
		SET_ALARM(ALARM_SENSOR_ERR);
		return ESP_FAIL;
	}
	CLEAR_ALARM(ALARM_SENSOR_ERR);
	return ESP_OK;
}

// Обработка состояний в режиме ректификации
void Rectification(void)
{
	double t;
	float tempEndRectRazgon;
	char b[80];
	static int16_t prev_status=START_WAIT;

	switch (MainStatus) {
	case START_WAIT:		// Ожидание запуска процесса
		if (prev_status!=MainStatus){
			prev_status=MainStatus;
			setPower(0);		// Снятие мощности с тэна
			closeAllKlp();		// Закрытие всех клапанов.
		}
		break;
	case PROC_START:
		// Начало процесса
		LOG("START");
		ProcChimSR=0;
		set_status(PROC_RAZGON); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_RAZGON: 		// Разгон до рабочей температуры

		tempEndRectRazgon = getFloatParam(DEFL_PARAMS, "tempEndRectRazgon");
		if (tempEndRectRazgon > 0) t = getCubeTemp();
		else t = getTube20Temp();

		// старт
		if (prev_status!=MainStatus){
			prev_status=MainStatus;
			set_proc_power("maxPower");
			startPressure = bmpTruePressure; // Фиксация атм. давления.
			closeAllKlp();		// Закрытие всех клапанов.
			LOG("RAZGON");
		}
		// контроль

