croghostrider/esp32_hd/main/hd_main.c
		if (sensor_err(t)) break;

		if (t < fabs(tempEndRectRazgon)) break;

		// завершение
		set_status(PROC_STAB);
		DBG("Switch state to stabilization."); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_STAB:		//Стабилизация колонны
		// старт
		t = getTube20Temp();
		if (prev_status!=MainStatus){
			LOG("STABILIZATION");
			openKlp(klp_water);	// Открытие клапана воды
			closeKlp(klp_glwhq);
			closeKlp(klp_sr);
			set_proc_power("powerRect");
			// Запоминаем температуру и время
	        setTempStabSR(t);
			setTempTube20Prev(t);
			secTempPrev = uptime_counter;
			prev_status=MainStatus;
		}

		// контроль
		if ( sensor_err(t) || (t < 70))			//сбой датчика или колонна еще не прогрелась, ждем
		{
			DBG("Cube or 20%% tube temperature less 70 dg.");
			secTempPrev = uptime_counter;
			break;
		}

		float timeStabKolonna = getFloatParam(DEFL_PARAMS, "timeStabKolonna");

		if (timeStabKolonna > 0) {			// Время считаем относительно последнего изменения температуры
			if (fabs(t - tempTube20Prev) < 0.2) {	// температура колонны в пределах погрешности в 0.2 градуса C
				DBG( "Stabillization %d of %02.0f sec.", uptime_counter-secTempPrev, fabs(timeStabKolonna));
				if (uptime_counter-secTempPrev<timeStabKolonna) {// время стабилизации истекло?
					break; // нет, продолжаем стабилизацию
				}
				// время стабилизации истекло, заканчиваем
			} else { // температура колонны изменилась более чем на 0.2 градуса
				DBG("Stab. temp. changed from %0.2f to %0.2f. Reseting timer.", tempTube20Prev, t);
		        setTempStabSR(t);
				setTempTube20Prev(t); // фиксируем новую температуру
				secTempPrev = uptime_counter;//начинаем отсчет времени с нуля
				break;
			}
		} else {	// время считаем от начала стабилизации
			DBG("Stabillization %d of %0.0f.", uptime_counter-secTempPrev, fabs(timeStabKolonna));
			if (uptime_counter-secTempPrev < fabs(timeStabKolonna)) {		// время истекло?
				break; // нет - продолжаем стабилизацию
			}
			// время стабилизации истекло, заканчиваем
		}

		// завершение
		set_status(PROC_GLV);	//переходим к отбору голов.
		DBG("end razgon, switch to `glv` stage"); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_GLV:			// Отбор головных фракций
		// старт
		if (prev_status!=MainStatus){
			LOG("PROC_GLV");
			prev_status=MainStatus;
			openKlp(klp_water);		// Открытие клапана воды
			closeKlp(klp_sr);				// Отключение клапана отбора товарного продукта
			secTempPrev = uptime_counter;
			setTempStabSR(getTube20Temp());	// температура стабилизации отбора
			set_proc_power("powerRect");
			start_valve_PWMpercent(
					klp_glwhq, // медленный ШИМ клапан голов
					getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
					getFloatParam(DEFL_PARAMS, "procChimOtbGlv"));
		}

		// контроль
		float tEndRectOtbGlv =getFloatParam(DEFL_PARAMS, "tEndRectOtbGlv");

		if (tEndRectOtbGlv>0){ 						// tEndRectOtbGlv положительный -> это температура куба завершения отбора голов
			t = getCubeTemp();
			if (sensor_err(t)) break; 					// ошибка датчика, ждем исправления

			if (t < tEndRectOtbGlv) 	// Т куба не достигла заданной
				break;											// продолжаем
		}
		else {												// tEndRectOtbGlv отрицательное -> это кол-во минут отбора голов
			if ((uptime_counter-secTempPrev) < (-tEndRectOtbGlv*60) )	// время не истекло
				break;												// продолжаем
		}

		// Окончание отбора голов
		set_status(PROC_T_WAIT);		// Переходим к стабилизации температуры
		DBG("end glv, switch to `T wait` stage"); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_T_WAIT: // ре-стабилизация  после стопа
		// старт
		t = getTube20Temp();

		if (prev_status!=MainStatus){
			LOG("PROC_RESTAB");
			closeKlp(klp_sr);				// Отключение клапана отбора товарного продукта
			closeKlp(klp_glwhq); 		// Отключение клапана отбора голов/хвостов
			openKlp(klp_water);		// Открытие клапана воды
			if ((prev_status == PROC_SR)){ //попали сюда по "стоп" отбора продукта
				rect_timer1 = getIntParam(DEFL_PARAMS, "timeRestabKolonna");
			}
			else {//попали сюда или с отбора голов или после [ре]старта контроллера
				if (!broken_proc){
					setTempStabSR(t); // начальная температура стабилизации
					setNewProcChimSR(getIntParam(DEFL_PARAMS, "beginProcChimOtbSR")); // стартовый % отбора тела
					DBG("broken or HEAD init PWM:%d  init Tstab:%5.1f",getIntParam(DEFL_PARAMS, "beginProcChimOtbSR"),t);
				}
				set_proc_power("powerRect");  //задаем мощность ректификации
			}
			prev_status=MainStatus;
		}
		if (sensor_err(t)) break; // сбой датчика, ждем
		if (tempStabSR <= 0) setTempStabSR(28.5);

		//-----------контроль
		// настройка времени рестабилизации не ноль и истек таймер: принимаем текущую температуру за Тстаб
		if ( (0 == rect_timer1) &&  // таймер досчитал
			 (getIntParam(DEFL_PARAMS, "timeRestabKolonna") > 0) // настройка времени стабилизации не ноль
			) {
			DBG("restab. newTstab:%0.2f  timer:%d setting:%d", tempStabSR,rect_timer1,getIntParam(DEFL_PARAMS, "timeRestabKolonna"));
			setTempStabSR(getTube20Temp());		// принимаем текущую температуру за Тстаб
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		}

		//  пока рестабилизировались - не пришла ли пора завершить тело и перейти к хвостам?
		if (end_condition_SR())	{
       		set_status(PROC_HV); // Уходим на стадию отбора хвостов
			break;
		}
		
		//  проверим: Т низа колонные снизилась до Тстаб?
		if (getTube20Temp() > tempStabSR) {
			break; //если нет, остаемся в рестабилизации
		}
		//рестабилизация завершена

		//------------- завершение---------------
		secTempPrev = uptime_counter;	// время, когда стабилизировалась температура
		DBG("T restored; go to SR. T:%0.2f", tempStabSR);
		set_status(PROC_SR);	// @suppress("No break at end of case") Переход к отбору продукта
        /* fall through */

	case PROC_SR:	// Отбор СР
		// старт
		if (prev_status!=MainStatus){
			if (prev_status!=PROC_T_WAIT) { // если не после рестабилизации
				openKlp(klp_water);		// Открытие клапана воды
				closeKlp(klp_glwhq); 		// Отключение клапана отбора голов/хвостов
				set_proc_power("powerRect");
			}
			int pwm=GetSrPWM();// PWM отбора (по-шпоре)
			DBG("pwm by shpora %d",pwm);
			setNewProcChimSR(pwm);
			int period=getIntParam(DEFL_PARAMS, "timeChimRectOtbSR");
			start_valve_PWMpercent	// включаем медленный ШИМ клапана продукта
			  ( klp_sr,
				period,// период ШИМ в сек
				ProcChimSR //%
			  );

			if (tempStabSR <= 0) setTempStabSR(28.5);
			prev_status=MainStatus;
			LOG("PROC_SR  Tstab:%5.1f PWM:%d%%(%d sec)",tempStabSR,ProcChimSR,period);
		}

		//-----------контроль
		t = getTube20Temp(); // T низа колонны
		if (sensor_err(t)) break; // сбой датчика, ждем

