croghostrider/esp32_hd/main/hd_main.c
	switch (MainStatus) {
	case START_WAIT:
		if (prev_status!=MainStatus){
			prev_status=MainStatus;
			closeAllKlp();
			if (SetPower) setPower(0);
		}
		// Ожидание запуска процесса
		break;

	case PROC_START:		// Начало процесса
		startPressure = bmpTruePressure; // Фиксация атм. давления.
		set_status(PROC_RAZGON); // @suppress("No break at end of case")
		/* fall through */

	case PROC_RAZGON:		// Разгон до рабочей температуры
		if (prev_status!=MainStatus){
			prev_status=MainStatus;
			closeAllKlp();
			set_proc_power("maxPower");
		}

		t = getCubeTemp();
		if (sensor_err(t)){ // сбой датчика
			break;
		}

		if (t < getFloatParam(DEFL_PARAMS, "tEndDistRazgon")) break;
		// go to next
		set_status(PROC_DISTILL); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_DISTILL:		// Процесс дистилляции
		t = getCubeTemp();
		t_end = getFloatParam(DEFL_PARAMS, "tEndDistil");
		if (prev_status!=MainStatus){
			openKlp(klp_water);
			openKlp(klp_sr);
			closeKlp(klp_glwhq);
			set_proc_power("powerDistil"); // Мощность дистилляции
			prev_status=MainStatus;
			if (t_end < 0){ // настроен отбор по времени
				secTempPrev = uptime_counter + (-(uint32_t)t_end*60); // фиксируем время завершения отбора
			}
		}

		if (t_end<0) {
			if (uptime_counter<secTempPrev) break; // ждем времени завершения
		}
		else {
			if (sensor_err(t)){ // сбой датчика
				break;
			}
			if (t < t_end) break; // ждем температуру завершения
		}
		//Завершение
		set_status(PROC_WAITEND);	 //@suppress("No break at end of case")
		//break;


	case PROC_WAITEND:	// Отключение нагрева, подача воды для охлаждения
#define DISTILL_COOLDOWN_DETLTA_T 1.0
		// старт
		if (prev_status!=MainStatus){
			setPower(0);		// Снятие мощности с тэна
			openKlp(klp_water);		// Открытие клапана воды
			closeKlp(klp_glwhq); 	    // Отключение клапана отбора голов/хвостов
			closeKlp(klp_sr); 			// Отключение клапана продукта
			controlT = getCubeTemp()-DISTILL_COOLDOWN_DETLTA_T; // фиксируем текущую T
			secTempPrev = uptime_counter; // и текущее время
			prev_status=MainStatus;
			if (controlT>0){
				LOG("PROC_COOLDOWN (till Tcube:%5.1f)",controlT);
			}
			else {
				LOG("PROC_COOLDOWN (for 180 sec)");
			}
		}

		//  контроль завершения
		if (controlT>0) { // датчик исправен, контролируем завершение охлаждения по нему
			//ждем когда Т куба снизится до контрольной температуры
			if (getCubeTemp() > controlT) break;
		}
		else { // иначе контроль завершения по времени
			if ((uptime_counter - secTempPrev) < 180) break; //ждем 180 секунд
		}
		//  завершение
		set_status(PROC_END);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true); // @suppress("No break at end of case")
		//break;

	case PROC_END:
		// Окончание работы
		if (prev_status!=MainStatus){
			SecondsEnd = uptime_counter;
			prev_status=MainStatus;
			setPower(0);		// Снятие мощности с тэна
			closeAllKlp();		// Закрытие всех клапанов.
			sprintf(b, "Distillation complete, time: %02d:%02d:%02d", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);
			sendSMS(b);
			if (getIntParam(DEFL_PARAMS, "DIFFoffOnStop")) {
				xTaskCreate(&diffOffTask, "diff Off task", 4096, NULL, 1, NULL); // выключаем дифф
			}
		}
		break;
	}
}

/*
 * send command (ON/OFF) to valvePWMtask
 */
void cmd2valve (int valve_num, valve_cmd_t cmd){
	static valveCMDmessage_t cmd_message;
	DBGV("v:%d cmd:%d",valve_num, cmd);
	if (valve_num>=MAX_KLP) {
		ERR_MSG("incorrect valve num %d", valve_num);
		return;
	}
	if (valve_cmd_queue){
		cmd_message.cmd = cmd;
		cmd_message.valve_num=valve_num;
		if (xQueueSend( valve_cmd_queue, ( void * ) &cmd_message, ( TickType_t ) 10 )!= pdPASS){
			ERR_MSG("timeout of cmd sending");
		}
	}
	else {
		ERR_MSG("CMD queue doesn't exist");
	}
}

/*
 * Закрытие всех клапанов.
 */
void closeAllKlp(void)
{
	for (int i=0; i<MAX_KLP; i++)	closeKlp(i);
}

/*
 * Открытие клапана с выключением программного ШИМ
 */
void openKlp(int i)
{
	cmd2valve(i, cmd_open);
	Klp[i].is_pwm = false;
}

/*
 * Закрытие клапана с выключением программного ШИМ
 */
inline void closeKlp(int i)
{
	cmd2valve (i, cmd_close);
	Klp[i].is_pwm = false;
}

/*
 * Запуск шима клапана
 */
void startKlpPwm(int i, float topen, float tclose)
{
	if (i>=MAX_KLP) return;
	DBGV( "PWM klp %d %.1f/%.1f", i, topen, tclose);
	Klp[i].open_time = topen;	// Время в течении которого клапан открыт
	Klp[i].close_time = tclose;	// Время в течении которого клапан закрыт
	Klp[i].is_pwm = true;	// Запускаем медленный Шим режим

	if (! Klp[i].pwm_task_Handle){
		xTaskCreate(valvePWMtask, "valvePWMtask", 8192, (void *)i, 5, &Klp[i].pwm_task_Handle);	//запускаем задачу программного ШИМ клапана
		vTaskDelay( 100/portTICK_PERIOD_MS );
	}
	else
		vTaskResume( Klp[i].pwm_task_Handle);
}

/* Запуск программного ШИМ с параметрами
* @клапан
* @период в сек
* @процент времени открытия
*/
void start_valve_PWMpercent(int valve_num, float period_sec, float percent_open){
	float topened= (period_sec*percent_open)/100.0;
	float tclosed=period_sec-topened;
	DBGV("id:%d per:%.1f pwm:%.1f open:%.1f close:%.1f",valve_num,period_sec, percent_open,topened,tclosed);
	if ((topened < 0)||(topened<0)||(period_sec==0)){
		DBGV("incorrect param,period %.1f open %.1f close %.1f", period_sec, topened, tclosed);
		return;
	}
	startKlpPwm(valve_num, topened, tclosed);
}

static struct {
    struct arg_str *value;
    struct arg_end *end;
} set_args;

static int set_ct(int argc, char **argv)
{
	int nerrors = arg_parse(argc, argv, (void **) &set_args);
	if (nerrors != 0) {
		arg_print_errors(stderr, set_args.end, argv[0]);
		return 1;
	}
	const char *values = set_args.value->sval[0];
	float t = atof(values);
	DBG("New Cube temp: %f\n", t);
	return emulateT(DS_CUB, t);
}

const esp_console_cmd_t set_ct_cmd = {
        .command = "t",
        .help = "Emulate cube temp",
        .hint = NULL,
        .func = &set_ct,
        .argtable = &set_args
};

/* 'version' command */
static int get_version(int argc, char **argv)
{
	esp_chip_info_t info;
	esp_chip_info(&info);
	printf("IDF Version:%s\r\n", esp_get_idf_version());
	printf("Chip info:\r\n");
	printf("\tmodel:%s\r\n", info.model == CHIP_ESP32 ? "ESP32" : "Unknow");
	printf("\tcores:%d\r\n", info.cores);
	printf("\tfeature:%s%s%s%s%d%s\r\n",
           info.features & CHIP_FEATURE_WIFI_BGN ? "/802.11bgn" : "",
           info.features & CHIP_FEATURE_BLE ? "/BLE" : "",
           info.features & CHIP_FEATURE_BT ? "/BT" : "",
           info.features & CHIP_FEATURE_EMB_FLASH ? "/Embedded-Flash:" : "/External-Flash:",
           spi_flash_get_chip_size() / (1024 * 1024), " MB");
	printf("\trevision number:%d\r\n", info.revision);
	return 0;
}

static void register_version()
{
    const esp_console_cmd_t cmd = {
        .command = "version",
        .help = "Get version of chip and SDK",
        .hint = NULL,
        .func = &get_version,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

