croghostrider/esp32_hd/main/hd_main.c
		LEDC.channel_group[0].channel[0].duty.duty = TRIAC_GATE_IMPULSE_CYCLES << 4;
	        // Initial brightness of 0, meaning turn TRIAC on at very end:
	    LEDC.channel_group[0].channel[0].conf0.sig_out_en = 0;
		LEDC.channel_group[0].channel[0].conf1.duty_start = 0;
	}

	// valves control
	valve_cmd_queue = xQueueCreate(10, sizeof(valveCMDmessage_t));			//---очередь команд открытия/закрытия клапанов
	if (! valve_cmd_queue){
		ERR_MSG("error of QUEUE creating!");
	}
	else {
		xTaskCreate(valveCMDtask, "valveCMDtask", 8192, NULL, 5, NULL);	//---задача включения/выключения клапанов по командам
	}

	/* задача контроля флагов тревоги, звук при аварии, выключения дифф-автомата*/
	xTaskCreate(&alarmControlTask, "alarmControl", 4096, NULL, 1, NULL);

	if (getIntParam(DEFL_PARAMS, "DIFFoffOnStart")) {// при настройке "выключать дифф при старте"
		xTaskCreate(&diffOffTask, "diff Off task", 4096, NULL, 1, NULL); // выключаем дифф
	}

	ESP_ERROR_CHECK(gpio_intr_enable(GPIO_DETECT_ZERO));
	DBG("Enabled zero crossing interrupt");

	if (getIntParam(DEFL_PARAMS, "useExernalAlarm")) {
		ESP_ERROR_CHECK(gpio_intr_enable(GPIO_ALARM));
	}

	restoreProcess();

	if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(false);

#ifdef DEBUG1
	emulateT(DS_CUB, 80.0);
	emulateT(DS_TUBE20, 45.0);
#endif

	while (true) {
		cJSON *ja = getInformation();
     		char *r=cJSON_Print(ja);
		cgiWebsockBroadcast("/ws", r, strlen(r), WEBSOCK_FLAG_NONE);
		cJSON_Delete(ja);
		if (r) free(r);
		if (MODE_RECTIFICATION == MainMode) Rectification();
		else if (MODE_DISTIL == MainMode) Distillation();
		vTaskDelay(wsPeriod*1000/portTICK_PERIOD_MS);
	}
}

void valveCMDtask(void *arg){
	valveCMDmessage_t qcmd;
	ledc_channel_t ch;
	TickType_t xLastWakeTime=0;
#ifdef DEBUGV
	TickType_t prevValveSwitch=0;
#endif

	// LEDC
	ledc_timer_config_t ledc_timer1 = {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
		.duty_resolution = LEDC_TIMER_10_BIT,
#else
		.bit_num = LEDC_TIMER_10_BIT,
#endif
		.freq_hz = VALVES_CONTROL_LED_FREQ_HZ,
		.speed_mode = LEDC_HIGH_SPEED_MODE,
		.timer_num = LEDC_TIMER_1
	};
	ESP_ERROR_CHECK(ledc_timer_config(&ledc_timer1));
	// Настройка клапанов управления
	for (int i=0; i<MAX_KLP; i++) {
		ledc_channel_config_t ledc_channel = {
			.gpio_num = klp_gpio[i],
			.speed_mode = LEDC_HIGH_SPEED_MODE,
			.channel = i+1,
			.timer_sel = LEDC_TIMER_1,
			.duty = 0,
			.intr_type = LEDC_INTR_DISABLE,
		};
		Klp[i].is_open = false;
		Klp[i].channel = i+1; // +1 т.к. нулевой канал зарезервирован под регулятор мощности
		Klp[i].pwm_task_Handle=NULL;
		ESP_ERROR_CHECK(ledc_channel_config(&ledc_channel));
		LEDC.channel_group[0].channel[i+1].conf0.sig_out_en = 0;
	}
	ledc_fade_func_install(0);

	while (1){
		if (xQueueReceive(valve_cmd_queue, &qcmd, portMAX_DELAY)!=pdTRUE) // ждем события на открытие/закрытие клапана
			continue;																							// если таймаут - повторим
		ch = Klp[qcmd.valve_num].channel;															// ledc-канал  клапана
		LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 1;
		DBGV("v:%d(ch:%d) cmd:%d",qcmd.valve_num,ch,qcmd.cmd);
		switch (qcmd.cmd) {
			case cmd_open:
				if (! Klp[qcmd.valve_num].is_open) { // если клапан закрыт то открываем
					// -------логика "тихого" включения
					xLastWakeTime = xTaskGetTickCount ();// системное время включения, в тиках
					if (getIntParam(DEFL_PARAMS,"klpSilentNode")) {
						ledc_set_fade_with_time(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY, VALVE_ON_FADE_TIME_MS);
						ledc_fade_start(LEDC_HIGH_SPEED_MODE, ch, LEDC_FADE_NO_WAIT);
						//vTaskDelay(VALVE_ON_FADE_TIME_MS/portTICK_PERIOD_MS);
					} else {
						ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY);
						ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
					}
	#ifdef DEBUGV
					DBGV(" ON:%d(%d ms)",qcmd.valve_num, (xLastWakeTime-prevValveSwitch)*portTICK_PERIOD_MS );
					prevValveSwitch=xLastWakeTime;
	#endif
					Klp[qcmd.valve_num].is_open = true;
					// ---------логика снижения ШИМ клапана после его включения---------
					if (((qcmd.valve_num == klp_water)&&(getIntParam(DEFL_PARAMS,"klp1_isPWM"))) //если не клапан а насос, то не снижаем
						||
						 (qcmd.valve_num == klp_diff) // если это ключ выхода на дифф-автомат то не снижаем
						) break;

					if ((KEEP_KLP_PWM==0)||(KEEP_KLP_PWM==100)) break;								// если настройка ШИМ удержания 0 или 100 - не снижаем
					if (	(Klp[qcmd.valve_num].is_pwm)																//если клапан в ШИМ
							&&																										//и время открытого его состояния
							(KEEP_KLP_DELAY_MS >= (Klp[qcmd.valve_num].open_time*1000))			//меньше времени задержки до перехода на удержание
						)	{																											// то не снижаем
						break;
					}

					vTaskDelayUntil( &xLastWakeTime, KEEP_KLP_DELAY_MS/portTICK_PERIOD_MS );//ждем включения механики клапана
					ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, ((VALVE_DUTY*KEEP_KLP_PWM)/100ul));
					ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
				}
				else {
					DBGV("ON ignored");
				}
				break;

			case cmd_close:
				if (Klp[qcmd.valve_num].is_open){ // закрываем если открыт
#ifdef DEBUGV
					xLastWakeTime = xTaskGetTickCount ();
					DBGV("OFF:%d(%d ms)", qcmd.valve_num, (xLastWakeTime-prevValveSwitch)*portTICK_PERIOD_MS);
					prevValveSwitch =xLastWakeTime;
#endif
					ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, 0);
					ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
					LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 0;
					Klp[qcmd.valve_num].is_open = false;
				}
				else {
					DBGV("cmd close ignored");
				}
				break;
			default:
				break;
		}
	}
}

void setTimezone(int gmt_offset){
	char tz[10];
	snprintf(tz, 10, "CST-%d", gmt_offset);
	setenv("TZ", tz, 1);
	tzset();
}

void restoreProcess(void) {
	int16_t pw;
	if (!nvsHandle) {
		ERR_MSG("no NVS handle, process isn't restored");
		return;
	}
	nvs_get_i16(nvsHandle, "MainMode", (int16_t*)&MainMode);
	nvs_get_i16(nvsHandle, "SetPower", &pw);
	nvs_get_i16(nvsHandle, "MainStatus", &MainStatus);
	DBG("MMode:%d State:%d Power:%d",MainMode,MainStatus,pw);
	switch (MainMode) {
		case  MODE_RECTIFICATION:
		case  MODE_DISTIL:
			if ( (MainStatus>PROC_START) && (MainStatus<PROC_END)){
				broken_proc = true;
				ESP_ERROR_CHECK(nvs_get_u64(nvsHandle, "tempStabSR", (uint64_t*)&tempStabSR));
				nvs_get_u64(nvsHandle, "tempTube20Prev", (uint64_t*)&tempTube20Prev);
				nvs_get_i16(nvsHandle, "ProcChimSR", &ProcChimSR);
				DBG("broken proc=true  Tstab:%02.1f Tprev:%02.1f ProcPWM:%d",tempStabSR,tempTube20Prev,ProcChimSR);
			} // @suppress("No break at end of case")
		case  MODE_POWEERREG:
			  setPower(pw);
			  break;
		default:
			break;
	}
}

void write2log(const char* s){
	cJSON *ja;
	char data[80];

	ja = cJSON_CreateObject();
	cJSON_AddItemToObject(ja, "cmd", cJSON_CreateString("logline"));
	cJSON_AddItemToObject(ja, "ch", cJSON_CreateString(""));
	cJSON_AddItemToObject(ja, "level", cJSON_CreateString(""));

	time_t CurrentTime=time(NULL);
	struct tm CurrentTm;
	localtime_r(&CurrentTime, &CurrentTm);
	snprintf(data, sizeof(data)-1, "%02d-%02d-%d %02d:%02d:%02d", CurrentTm.tm_mday,CurrentTm.tm_mon+1,CurrentTm.tm_year+1900, CurrentTm.tm_hour, CurrentTm.tm_min,CurrentTm.tm_sec);
	cJSON_AddItemToObject(ja, "date", cJSON_CreateString(data));
	cJSON_AddItemToObject(ja, "message", cJSON_CreateString(s));

 	char *r=cJSON_Print(ja);
	cgiWebsockBroadcast("/ws", r, strlen(r), WEBSOCK_FLAG_NONE);
	cJSON_Delete(ja);
	if (r) free(r);
}
